module.exports = (context) ->
    pluralize: (n) -> switch
        when n < 3 then n
        when n % 100 >= 3 and n % 100 <= 10 then 3
        when n % 100 >= 11 and n % 100 <= 99 then 4
        else 5

    join: (array) ->
        array.join ' و'

    past: 'منذ ${pretty}'
    future: 'بعد ${pretty}'
    now: 'الآن'

    second: [
        ''
        'ثانية'
        'ثانيتين'
        '${n} ثوان'
        '${n} ثانية'
        '${n} ثانية'
    ]

    minute: [
        ''
        'دقيقة'
        'دقيقتين'
        '${n} دقائق'
        '${n} دقيقة'
        '${n} دقيقة'
    ]

    hour: [
        ''
        'ساعة'
        'ساعتين'
        '${n} ساعات'
        '${n} ساعة'
        '${n} ساعة'
    ]

    day: [
        ''
        'يوم'
        'يومين'
        '${n} أيام'
        '${n} يوما'
        '${n} يوم'
    ]

    week: [
        ''
        'أسبوع'
        'أسبوعين'
        '${n} أسابيع'
        '${n} أسبوعاً'
        '${n} أسبوع'
    ]

    month: [
        ''
        'شهر'
        'شهرين'
        '${n} شهور'
        '${n} شهراً'
        '${n} شهر'
    ]

    year: [
        ''
        'عام'
        'عامين'
        '${n} أعوام'
        '${n} عاماً'
        '${n} عام'
    ]